package com.green.day05.ch07;

public class ObjectStudy {
    /*
    클래스(class) = 데이터(Data) + 메소드(Method)
                     속성(명사) + 메소드(동사)
                     필드
                     맴버필드   + 멤버메소드
                     맴버변수
                     전역변수

     속성은 데이터를 저장하기 위한 공간(전역 변수)

     인간-속성: 혈액형, 생년월일, 성별, 국가, 머리색, 키, 몸무게
         - 메소드: 일어난다, 소리지른다, 잔다, 뛴다.

     클래스를 이용해 객체(인스턴스)를 만든다.
     만드는 행위를 객체화 or 인스턴스화 라고 부르며
     new 키워드를 사용한다.
     
     class        vs  객체
     문서              실체(진짜)
     아파트 설계도      설계도로 만든 아파트
     Tv 설계도         Tv 설계도로 만든 Tv

     우리가 클래스에 적는 내용은 이 객체가 만들어졌을 때
     작동하는 방식을 적는 것이다.
     예를들어, 이러이러한 데이터를 저장해라, 이러이러한 데이터를 변경해라. (메소드)
     그러면 데이터를 저장할 수 있는 공간도 필요하다. (속성)


     기본타입(Primitive Type)을 제외한 모든 변수는
     참조변수(Reference Type)입니다.
     참조변수는 객체의 주소값을 저장한다.
     Karl(클래스명) abc(변수명);
     abc 변수는 Karl객체의 주소값만 담을 수 있다. (저장할 수 있다.)
     참조변수끼리의 == 비교는 주소값이 같은지 비교한다.

     객체를 이용할 때는 "주소값." 으로 이용한다.
     */
}
